Revit 2026 API

# NavisworksExportScope Enumeration

---

An enumerated type listing possible "Element Scopes" of Navisworks Exporter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum NavisworksExportScope
```
```vb
Public Enumeration NavisworksExportScope
```
```cpp
public enum class NavisworksExportScope
```
```fsharp
type NavisworksExportScope
```

| Member name | Value | Description |
| --- | --- | --- |
| Model | 0 | Export all elements in the document. |
| SelectedElements | 2 | Export the selected elements. |
| View | 1 | Export the elements in a view. |

#### Reference

Autodesk.Revit.DB Namespace